In [1]:
import numpy as np

In [2]:
import pandas as pd

.index
.column

.apply(fun)
.sum()
.sort_values(by= )


.unique()
.nunique()
.value_counts()
.isnull()

In [3]:
x=pd.DataFrame({'a':[1,2,3,4,5], 'b':[20,20,30,40,50] })

In [4]:
x

   a   b
0  1  20
1  2  20
2  3  30
3  4  40
4  5  50

In [5]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
x.columns

Index(['a', 'b'], dtype='object')

In [9]:
x['b'].sum()

160

In [10]:
def inc(x):
    x=x+100
    return  x

In [12]:
#applying the above increase function (i.e increasing value by 100) to all the parts of b
x['b'].apply(inc)

0    120
1    120
2    130
3    140
4    150
Name: b, dtype: int64

In [17]:
y=pd.DataFrame({'a':[1,4,5,3,2], 'b':[40,50,30,20,20] })

In [18]:
y

   a   b
0  1  40
1  4  50
2  5  30
3  3  20
4  2  20

In [19]:
#sorting
y.sort_values('b')

   a   b
3  3  20
4  2  20
2  5  30
0  1  40
1  4  50

In [21]:
y.sort_values('a')

   a   b
0  1  40
4  2  20
3  3  20
1  4  50
2  5  30

In [23]:
#unique refers to single data
y['b'].unique()

array([40, 50, 30, 20], dtype=int64)

In [24]:
#number of unique data
y['b'].nunique()

4

In [26]:
#to count the values
y['b'].value_counts()

20    2
30    1
50    1
40    1
Name: b, dtype: int64

In [27]:
#to check null values
y.isnull()

       a      b
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False